In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'Employee':['Alice', 'Bob', 'Charlie', 'David'],
                   'Department':['IT', 'HR', 'FINANCE','IT'],
                   'Salary':[60000, 50000, 70000, 65000]})

df

  Employee Department  Salary
0    Alice         IT   60000
1      Bob         HR   50000
2  Charlie    FINANCE   70000
3    David         IT   65000

In [3]:
data_list = [['Alice', 25, 50000], ['Bob', 30, 60000], ['Charlie', 22, 45000]]
data_list

[['Alice', 25, 50000], ['Bob', 30, 60000], ['Charlie', 22, 45000]]

In [4]:
df_list = pd.DataFrame(data_list)
df_list

         0   1      2
0    Alice  25  50000
1      Bob  30  60000
2  Charlie  22  45000

In [6]:
columns = ['Name', 'Age', 'Salary']
df_list_col = pd.DataFrame(data_list,columns=columns)
df_list_col

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   22   45000

In [7]:
df_list_col.shape

(3, 3)

In [8]:
df_list_col.columns

Index(['Name', 'Age', 'Salary'], dtype='str')

In [9]:
df_list_col.dtypes

Name        str
Age       int64
Salary    int64
dtype: object

In [10]:
df_list_col.head()

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   22   45000

In [11]:
df_list_col.tail()

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   22   45000

In [12]:
df_list_col['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: str

In [13]:
df_list_col['Salary']

0    50000
1    60000
2    45000
Name: Salary, dtype: int64

In [14]:
df_list_col[['Name','Salary']]

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   45000

In [15]:
df_list_col['Salary'].mean()

np.float64(51666.666666666664)

In [16]:
df_list_col['Salary'].max()

np.int64(60000)

In [17]:
df_list_col['Salary'].min()

np.int64(45000)

In [4]:
df1 = pd.read_csv('housing.csv')

NameError: name 'pd' is not defined

In [ ]:
df1